Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། གཟུགས་ལ་མི་རྟག་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་རྟག་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་སྲེད་པ་སྟེ་སྐྱོན་ཡིན་ནོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི། གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་སྡུག་བསྔལ་ཞེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་། ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་།
en: The Blessed One replied, “Śāradvatī­putra, when great bodhisattva beings who practice the transcendent perfection of wisdom establish, cognize, and become fixated on the notion that physical forms are impermanent, and similarly, when they establish, cognize, and become fixated on the notion that feelings, perceptions, formative predispositions, and consciousness are impermanent, this craving for the sacred doctrine in the case of great bodhisattva beings is indicative of their immaturity.

source: གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་བདག་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་སྟོང་ཞེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་མཚན་མ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་སྨོན་པ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་ཞི་ཞེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་། ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་དབེན་ཞེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་རྣམ་པར་བྱང་ཞེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་སྐྱེ་བ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་གཟུགས་ནས་རྣམ་པར་ཤེས་པའི་བར་ལ་འགག་པ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་གཟུགས་ལ་དངོས་པོ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། རྣམ་པར་ཤེས་པའི་བར་ལ་དངོས་པོ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་སྟེ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་སྲེད་པ་སྟེ་སྐྱོན་ཡིན་ནོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings who practice the transcendent perfection of wisdom establish, cognize, and become fixated on the notion that [the aggregates] from physical forms to consciousness are imbued with suffering; when they establish, cognize, and become fixated on the notion that [the aggregates] from physical forms to consciousness are not a self; when they establish, cognize, and become fixated on the notion that [the aggregates] from physical forms to consciousness are empty; and similarly, when they establish, cognize, and become fixated on the notion that [the aggregates] from physical forms to consciousness are signless; and similarly, when they establish, cognize, and become fixated on the notion that [the aggregates] from physical forms to consciousness are without aspirations; and similarly, when they establish, cognize, and become fixated on the notion that [the aggregates] from physical forms to consciousness are calm; and similarly, when they establish, cognize, and become fixated on the notion that [the aggregates] from physical forms to consciousness are void; and similarly, when they establish, cognize, and become fixated on the notion that [the aggregates] from physical forms to consciousness are purified; and similarly, when they establish, cognize, and become fixated on the notion that [the aggregates] from physical forms to consciousness do not arise; and similarly, when they establish, cognize, and become fixated on the notion that [the aggregates] from physical forms to consciousness do not cease; and similarly, when they establish, cognize, and become fixated on the notion that physical forms are non-entities; and similarly, when they establish, cognize, and become fixated on the notion that [the other aggregates], up to and including consciousness, are non-entities—in all such cases, Śāradvatī­putra, this craving for the sacred doctrine in the case of great bodhisattva beings indicates their immaturity.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མི་མཁས་པས་སྔར་ངེས་པར་ལྟུང་བ་ཡིན་ཞིང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་ལ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་ཡང་མི་འཇུག་པ་ཡིན་ནོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི་ཐབས་ལ་མཁས་པས་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་མི་རྟག་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་སྡུག་བསྔལ་ཞེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་།
en: Śāradvatī­putra, it is in this way that unskilled great bodhisattva beings have formerly regressed, descended to the levels of the śrāvakas and pratyekabuddhas, and failed to enter into the maturity of the bodhisattvas.

source: དེ་བཞིན་དུ་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་བདག་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་སྟོང་ཞེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་མཚན་མ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་སྨོན་པ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་ཞི་ཞེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་དབེན་ཞེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་རྣམ་པར་བྱང་ཞེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་སྐྱེ་བ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་མིག་ནས་ཆོས་རྣམས་ཀྱི་བར་ལ་འགག་པ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། དེ་བཞིན་དུ་མིག་ལ་དངོས་པོ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་དང་། ཆོས་རྣམས་ཀྱི་བར་ལ་དངོས་པོ་མེད་ཅེས་བྱ་བར་གནས་པར་བྱེད་ཅིང་ཀུན་ཏུ་ཤེས་ལ་མངོན་པར་ཞེན་པ་སྟེ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་སྲེད་པ་སྟེ་སྐྱོན་ཞེས་བྱའོ། །
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings who practice the transcendent perfection of wisdom establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are impermanent, owing to their lack of skill in means; and similarly, when they establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are imbued with suffering; and similarly, when they establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are not a self; and similarly, when they establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are empty; and similarly, when they establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are signless; and similarly, when they establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are without aspirations; and similarly, when they establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are calm; and similarly, when they establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are void; and similarly, when they establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are purified; and similarly, when they establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are non-arising; and similarly, when they establish, cognize, and become fixated on the notion that [the sensory elements] from the eyes to mental phenomena are unceasing; and similarly, when they establish, cognize, and become fixated on the notion that the eyes are non-entities; and similarly, when they establish, cognize, and become fixated on the notion that [the other sensory elements], up to and including mental phenomena, are non-entities—in all such cases, Śāradvatī­putra, this craving for the sacred doctrine in the case of great bodhisattva beings indicates their immaturity.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མི་མཁས་པས་སྔར་ངེས་པར་ལྟུང་བ་ཡིན་ཞིང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་རབ་ཏུ་ལྟུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་མི་འཇུག་པ་ཡིན་ནོ། །
en: Śāradvatī­putra, it is in this way that unskilled great bodhisattva beings have formerly regressed, descended to the levels of the śrāvakas and pratyekabuddhas, and failed to enter into the maturity of the bodhisattvas.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ཐབས་ལ་མི་མཁས་པས་ཁམས་རྣམས་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དག་ནས། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དང་། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ནས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཇི་ལྟར་ཕུང་པོ་དག་གི་སྐབས་སུ་སྦྱར་བ་བཞིན་ཐམས་ཅད་དུ་རྒྱ་ཆེར་སྦྱར་བར་བྱ་སྟེ།
en: “Moreover, Śāradvatī­putra, when great bodhisattva beings practice the transcendent perfection of wisdom, owing to their lack of skill in means, the same refrain should be extensively applied to all the sensory elements and [all the causal attributes] from the applications of mindfulness, up to and including the noble eightfold path, and likewise, to [all the fruitional attributes] from the ten powers of the tathāgatas, up to and including the eighteen distinct qualities of the buddhas—just as has been indicated here in the context of the psycho-physical aggregates.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མི་མཁས་པས་སྔར་ངེས་པར་ལྟུང་བ་ཡིན་ཞིང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སར་རབ་ཏུ་ལྟུང་བ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་ཡང་མི་འཇུག་པ་ཡིན་ནོ། །
en: Śāradvatī­putra, it is in that way that unskilled great bodhisattva beings have formerly regressed, descended to the levels of the śrāvakas and pratyekabuddhas, and failed to enter into the maturity of the bodhisattvas.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་སྐད་ཅེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མ་མཆིས་པ་གང་ལགས་ཞེས་གང་སྨྲས་པ་ཡང་།
en: “Śāradvatī­putra, you also asked what is the maturity of a great bodhisattva being.

source: ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ། ཅི་ནས་གཟུགས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱའོ། །
en: In this regard, Śāradvatī­putra, great bodhisattva beings who practice the transcendent perfection of wisdom should train as follows: They should not in any respect make assumptions on account of physical forms.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པས་རློམ་སེམས་སུ་མི་བྱ།
en: They should not make assumptions on account of feelings, perceptions, formative predispositions, and consciousness.

source: མིག་གིས་རློམ་སེམས་སུ་མི་བྱ། དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་ལྕེ་དང་། ལུས་དང་ཡིད་ཀྱིས་རློམ་སེམས་སུ་མི་བྱ།
en: They should not make assumptions on account of the eyes, and similarly, they should not make assumptions on account of the ears, the nose, the tongue, the body, and the mental faculty.

source: གཟུགས་རྣམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱ། དེ་བཞིན་དུ་སྒྲ་དང་། དྲི་དང་རོ་དང་། རེག་བྱ་དང་། ཆོས་རྣམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱ།
en: They should not make assumptions on account of sights, and similarly, they should not make assumptions on account of sounds, odors, tastes, tangibles, and mental phenomena.

source: མིག་གི་ཁམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱ།
en: They should not make asumptions on account of the sensory element of the eyes.

source: གཟུགས་ཀྱི་ཁམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱ།
en: They should not make assumptions on account of the sensory element of sights.

source: མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱ།
en: They should not make assumptions on account of the sensory element of visual consciousness.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཡིད་ཀྱི་ཁམས་ཀྱི་བར་གྱིས་རློམ་སེམས་སུ་མི་བྱ། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་གྱིས་རློམ་སེམས་སུ་མི་བྱ།
en: And in the same vein, they should not make assumptions on account of [all the other sensory elements], up to and including the sensory element of mental consciousness.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་རློམ་སེམས་སུ་མི་བྱ།
en: They should not make assumptions on account of the transcendent perfection of generosity.

source: དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་རློམ་སེམས་སུ་མི་བྱ།
en: Similarly, they should not make assumptions on account of the transcendent perfection of ethical discipline, the transcendent perfection of tolerance, the transcendent perfection of perseverance, the transcendent perfection of meditative concentration, and the transcendent perfection of wisdom.

source: དེ་བཞིན་དུ་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱ།
en: Similarly, they should not make assumptions on account of the meditative concentrations, the immeasurable aspirations, and the formless meditative absorptions.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་རློམ་སེམས་སུ་མི་བྱ། དེ་བཞིན་དུ་སྦྱར་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་གྱིས་རློམ་སེམས་སུ་མི་བྱ།
en: They should not make assumptions on account of the applications of mindfulness, and in the same vein, they should not make assumptions on account of [all the other causal attributes], up to and including the noble eightfold path.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུས་རློམ་སེམས་སུ་མི་བྱ། དེ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཀྱི་བར་གྱིས་རློམ་སེམས་སུ་མི་བྱའོ། །
en: Likewise, they should not make assumptions on account of the ten powers of the tathāgatas, and in the same vein, they should not make assumptions on account of [all the other fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པས། བྱང་ཆུབ་ཀྱི་སེམས་མི་མཉམ་པ་དང་མཉམ་པའི་སེམས་ཐུན་མོང་པ་མ་ཡིན་པའི་སེམས། རྒྱ་ཆེན་པོའི་སེམས་དེ་ཉིད་ཀྱིས་ཀྱང་རློམ་སེམས་སུ་མི་བྱའོ། །
en: Śāradvatī­putra, great bodhisattva beings who practice the transcendent perfection of wisdom should not make assumptions even on account of the enlightened mind, the mind that is equal to the unequaled, the uncommon mind, the mind of vast extent.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་སེམས་ཀྱི་རང་བཞིན་འོད་གསལ་བ་ཉིད་ཀྱི་ཕྱིར་རོ། །
en: If you ask why, it is because the intrinsic nature of this mind is luminosity.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་སེམས་ཀྱི་རང་བཞིན་འོད་གསལ་བ་ཉིད་གང་ལགས། དེ་སྐད་ཅེས་གསོལ་བ་དང་།
en: What is the nature of luminosity—the intrinsic nature of mind?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་སེམས་གང་འདོད་ཆགས་དང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན།
en: The Blessed One replied to the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, the mind neither has desire, nor is it without desire.

source: ཞེ་སྡང་དང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན།
en: It neither has hatred, nor is it without hatred.

source: གཏི་མུག་དང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན་ཞིང་།
en: It neither has delusion, nor is it without delusion.

source: དེ་བཞིན་དུ་ཀུན་ནས་ལྡང་བ་རྣམས་དང་། ཀུན་ཏུ་སྦྱོར་བ་རྣམས་དང་། བག་ལ་ཉལ་རྣམས་དང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན་པ་དང་།
en: Similarly, it neither has obsessions, fetters, or latent impulses, nor is it without them.

source: དེ་བཞིན་དུ་ལྟ་བའི་ཀུན་ཏུ་སྦྱོར་བ་ཐམས་ཅད་དང་ལྡན་པ་ཡང་མ་ཡིན། མི་ལྡན་པ་ཡང་མ་ཡིན་པ་དང་།
en: Similarly, it neither has all the fetters of philosophical view, nor is it without them.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སེམས་དག་དང་ལྡན་པ་ཡང་མ་ཡིན།
en: It neither has the mindsets of the śrāvakas and pratyekabuddhas, nor is it without them.

source: མི་ལྡན་པ་ཡང་མ་ཡིན་པ་འདི་ནི་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་རང་བཞིན་གྱིས་འོད་གསལ་བ་ཉིད་ཡིན་ནོ། །
en: This, Śāradvatī­putra, is the natural luminosity of the mind with which great bodhisattva beings are endowed.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The venerable Śāradvatī­putra then asked as follows: “Lord!

source: བཅོམ་ལྡན་འདས་ཅི་སེམས་མ་ལགས་པའི་སེམས་གང་ལགས་པ་དེ་མཆིས་ལགས་སམ།
en: Does this mind that is not the mind exist?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་སེམས་ཀྱི་སེམས་ཉིད་གང་ཡིན་པ་དེ་ལ་ཅི་ཡོད་པ་ཉིད་མ།
en: The Blessed One replied, “Śāradvatī­putra, does this nature of mind with which minds are endowed exist or not exist?

source: མེད་པ་ཉིད་མ། བདོག་པའམ། མི་བདོག་པའམ།
en: Does it have being or non-being?

source: དམིགས་པ་ཉིད་དམིགས་སུ་ཡོད་མ། གསོལ་པ།
en: In terms of apprehensibility, is it in fact apprehensible?”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་མ་མཆིས་ལགས་སོ། །
en: He replied, “Reverend Lord!

source: ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་སེམས་ཀྱི་སེམས་ཉིད་གང་ལ་ཡོད་པ་ཉིད་དམ། མེད་པ་ཉིད་མེད་ཅིང་མི་དམིགས་ན། ཤ་ར་དྭ་ཏིའི་བུས་གང་འདི་སྐད་ཅེས་སྨྲས་ཏེ། སེམས་མ་ལགས་པའི་སེམས་དེ་མཆིས་ལགས་སམ།
en: [The Lord Buddha] then said, “Śāradvatī­putra, if the nature of mind with which minds are endowed has neither existence nor non-existence, and if it is non-apprehensible, then Śāradvatī­putra, surely your question ‘Does this mind that is not the mind exist?’

source: ཞེས་བརྒལ་ཞིང་བརྟག་པ་འདི་ཇི་ག་རིགས་སམ།
en: is contestable. How can this reasoning be correct?”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་སེམས་ཀྱི་སེམས་ཉིད་དེ་གང་ལགས།
en: What is the nature of mind with which minds are endowed?”

source: བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ཐམས་ཅད་ལ་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སེམས་ཀྱི་སེམས་ཉིད་ཅེས་བྱའོ། །
en: He replied, “Śāradvatī­putra! That which is unchanging and without conceptual notions regarding all things is called the nature of mind with which minds are endowed.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སེམས་དེ་ཁོ་ན་འགྱུར་བ་མ་མཆིས་ཤིང་རྣམ་པར་རྟོག་པ་མ་མཆིས་ལ།
en: The venerable Śāradvatī­putra then asked the Blessed One, “Reverend Lord!

source: གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པ་དེ་ཁོ་ན་འགྱུར་བ་མ་མཆིས་ཤིང་རྣམ་པར་རྟོག་པ་མ་མཆིས་པ་ལགས་སམ།
en: Just as there are no changes and no conceptual notions regarding the actual mind, then are there no changes and no conceptual notions regarding actual physical forms, feelings, perceptions, formative predispositions, and consciousness?

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། འདུ་བྱེད་ཐམས་ཅད་ཀྱི་བར་དག་ཀྱང་འགྱུར་བ་མ་མཆིས་ཤིང་རྣམ་པར་རྟོག་པ་མ་མཆིས་པ་ལགས་སམ།
en: In the same vein, are there no changes and no conceptual notions regarding any [phenomena] at all, up to and including all formative predispositions?

source: དེ་ལྟར་གྱུར་ན་ནི་བྱང་ཆུབ་ཀྱི་བར་དུ་ཡང་འགྱུར་བ་མ་མཆིས་ཤིང་རྣམ་པར་རྟོག་པ་མ་མཆིས་པར་འགྱུར་ལགས་སོ། །
en: If that were the case, there would be no changes and no conceptual notions regarding all [attributes and attainments]. up to and including enlightenment.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ།
en: The Blessed One replied, “Śāradvatī­putra, that is right!

source: གང་གི་སེམས་དེ་ལྟར་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་ནས།
en: There are no changes and no conceptual notions regarding any mind.

source: འདུ་བྱེད་ཐམས་ཅད་ཀྱི་བར་དག་དང་། དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་བར་དུ་ཡང་དེ་ལ་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་ཡིན་ཏེ།
en: There are no changes and there are no conceptual notions regarding any [phenomena], up to and including all formative predispositions, and similarly regarding [all the attributes and attainments], up to and including enlightenment.

source: ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ཐམས་ཅད་ལ་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་སྐྱོན་མེད་པ་ཞེས་བྱའོ། །
en: Śāradvatī­putra, this absence of change and absence of conceptual notions regarding all things is designated as the maturity of a great bodhisattva being who practices the transcendent perfection of wisdom.

source: ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་ནི་འདི་ལྟ་སྟེ། ཐབས་ཀྱིས་ཡང་དག་པར་ཟིན་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཡིན་ནོ། །
en: “Moreover, Śāradvatī­putra, the maturity of a great bodhisattva being also entails the four applications of mindfulness which are correctly retained by skill in means.

source: བཞི་གང་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས་མི་དམིགས་པའི་ཚུལ་གྱིས་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས། ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་ལ། ལུས་ལ་བརྟེན་པའི་རྣམ་པར་རིག་པ་ཡང་མི་སྐྱེད་པ་དང་།
en: If you ask what these four are, they may be described as follows: (1) Great bodhisattva beings who are diligent, alert, and mindful, after eliminating worldly covetousness and sadness without apprehending anything, with regard to the inner body, continue to observe the physical body, without generating any apperceptions dependent on the physical body.

source: དེ་བཞིན་དུ་རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས། མི་དམིགས་པའི་ཚུལ་གྱིས་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས། ཕྱིའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་ལ། ལུས་ལ་བརྟེན་པའི་རྣམ་པར་རིག་པ་ཡང་མི་སྐྱེད་པ་དང་དེ་བཞིན་དུ་རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས་མི་དམིགས་པའི་ཚུལ་གྱིས་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་།
en: Similarly, those who are diligent, alert, and mindful, after eliminating worldly covetousness and sadness without apprehending anything, with regard to the outer body, continue to observe the physical body, without generating any apperceptions dependent on the physical body.

source: ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས། ནང་དང་ཕྱིའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་ལ། ལུས་ལ་བརྟེན་པའི་རྣམ་པར་རིག་པ་ཡང་མི་སྐྱེད་པ་དང་། དེ་བཞིན་དུ་རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས། མི་དམིགས་པའི་ཚུལ་གྱིས་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་།
en: Similarly, those who are diligent, alert, and mindful, after eliminating worldly covetousness and sadness without apprehending anything, with regard to the inner and outer body combined, continue to observe the physical body, without generating any apperceptions dependent on the physical body.

source: ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས། ནང་གི་ཚོར་བ་རྣམས་དང་། ཕྱིའི་ཚོར་བ་རྣམས་དང་། ཕྱི་ནང་གི་ཚོར་བ་རྣམས་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་ཞིང་གནས་ལ། ཚོར་བ་ལ་བརྟེན་པའི་རྣམ་པར་རིག་པ་ཡང་མི་སྐྱེད་པ་དང་།
en: (2) Those who are diligent, alert, and mindful, after eliminating worldly covetousness and sadness without apprehending anything, with regard to inner feelings, outer feelings, and combined inner and outer feelings, continue to observe feelings, without generating any apperceptions dependent on feelings.

source: དེ་བཞིན་དུ་རྟུན་པ་ཤེས་བཞིན་ཅན་དྲན་པ་དང་ལྡན་པས་མི་དམིགས་པའི་ཚུལ་གྱིས་འཇིག་རྟེན་ལ་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས། ནང་གི་སེམས་རྣམས་དང་། ཕྱིའི་སེམས་རྣམས་དང་། ཕྱི་ནང་གི་སེམས་རྣམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་ལ། སེམས་ལ་བརྟེན་པའི་རྣམ་པར་རིག་པ་ཡང་མི་སྐྱེད་པ་དང་།
en: (3) Those who are diligent, alert, and mindful, after eliminating worldly covetousness and sadness without apprehending anything, with regard to the inner mind, the outer mind, and the combined inner and outer mind, continue to observe the mind, without generating any apperceptions dependent on the mind.
